RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_axidmac.h
/******************************************************************************
 * Macro definitions                                                          *
 ******************************************************************************/

/**
* \addtogroup group_axidmac_macros
* \{
*/

/** The driver major version */
#define CY_AXIDMAC_DRV_VERSION_MAJOR       1

/** The driver minor version */
#define CY_AXIDMAC_DRV_VERSION_MINOR       0

/** The AXIDMAC driver identifier */
#define CY_AXIDMAC_ID                      (CY_PDL_DRV_ID(0x4BU))

/** The minimum M/X/Y Count API parameters */
#define CY_AXIDMAC_LOOP_COUNT_MIN          (1UL)
/** The maximum M/X/Y Count API parameters */
#define CY_AXIDMAC_LOOP_COUNT_MAX          (65536UL)

/** The minimum M/X/Y Increment API parameters */
#define CY_AXIDMAC_LOOP_INCREMENT_MIN      (-32768L)
/** The maximum M/X/Y Increment API parameters */
#define CY_AXIDMAC_LOOP_INCREMENT_MAX      (32767L)

/**
* \addtogroup group_axidmac_macros_interrupt_masks Interrupt Masks
* \{
*/

/** Bit 0: Completion of data transfer(s) as specified by the descriptor's interruptType setting. */
#define CY_AXIDMAC_INTR_COMPLETION         (AXI_DMAC_CH_INTR_COMPLETION_Msk)
/** Bit 1: Bus error for a load from the source. */
#define CY_AXIDMAC_INTR_SRC_BUS_ERROR      (AXI_DMAC_CH_INTR_SRC_BUS_ERROR_Msk)
/** Bit 2: Bus error for a store to the destination. */
#define CY_AXIDMAC_INTR_DST_BUS_ERROR      (AXI_DMAC_CH_INTR_DST_BUS_ERROR_Msk)
/** Bit 3: Invalid descriptor type. */
#define CY_AXIDMAC_INTR_INVALID_DESCR_TYPE  (AXI_DMAC_CH_INTR_INVALID_DESCR_TYPE_Msk)
/** Bit 5: The channel is enabled and the current descriptor pointer is "0". */
#define CY_AXIDMAC_INTR_CURR_PTR_NULL      (AXI_DMAC_CH_INTR_CURR_PTR_NULL_Msk)
/** Bit 6: The channel is disabled and the data transfer engine is busy. */
#define CY_AXIDMAC_INTR_ACTIVE_CH_DISABLED (AXI_DMAC_CH_INTR_ACTIVE_CH_DISABLED_Msk)
/** Bit 7: Bus error for a load of the descriptor. */
#define CY_AXIDMAC_INTR_DESCR_BUS_ERROR    (AXI_DMAC_CH_INTR_DESCR_BUS_ERROR_Msk)

/** \} group_axidmac_macros_interrupt_masks */

/** \} group_axidmac_macros */


/**
* \addtogroup group_axidmac_enums
* \{
*/

/** Contains the options for the descriptor type */
typedef enum
{
    CY_AXIDMAC_1D_MEMORY_COPY = 0UL,    /**< 1D Memory copy */
    CY_AXIDMAC_2D_MEMORY_COPY = 1UL,    /**< 2D Memory copy  */
    CY_AXIDMAC_3D_MEMORY_COPY = 2UL,    /**< 3D Memory copy  */
} cy_en_axidmac_descriptor_type_t;

/** Contains the options for the interrupt, trig-in and trig-out type parameters of the descriptor */
typedef enum
{
    CY_AXIDMAC_M_LOOP      = 0U,              /**< One M loop transfer.             */
    CY_AXIDMAC_X_LOOP      = 1U,              /**< One X loop transfer.              */
    CY_AXIDMAC_DESCR       = 2U,              /**< One descriptor transfer.          */
    CY_AXIDMAC_DESCR_CHAIN = 3U               /**< Entire descriptor chain transfer. */
} cy_en_axidmac_trigger_type_t;

/** Contains the options for descriptor retriggering */
typedef enum
{
    CY_AXIDMAC_RETRIG_IM      = 0U,           /**< Retrigger immediately.              */
    CY_AXIDMAC_RETRIG_4CYC    = 1U,           /**< Retrigger after 4 Clk_Slow cycles.  */
    CY_AXIDMAC_RETRIG_16CYC   = 2U,           /**< Retrigger after 16 Clk_Slow cycles. */
    CY_AXIDMAC_WAIT_FOR_REACT = 3U            /**< Wait for trigger reactivation.      */
} cy_en_axidmac_retrigger_t;


/** Contains the options for the state of the channel when the descriptor is completed   */
typedef enum
{
    CY_AXIDMAC_CHANNEL_ENABLED  = 0U,         /**< Channel stays enabled. */
    CY_AXIDMAC_CHANNEL_DISABLED = 1U          /**< Channel is disabled.   */
} cy_en_axidmac_channel_state_t;

/** Contains the return values of the AXIDMAC driver */
typedef enum
{
    CY_AXIDMAC_SUCCESS          = 0x0UL,      /**< Success. */
    CY_AXIDMAC_BAD_PARAM        = CY_AXIDMAC_ID | CY_PDL_STATUS_ERROR | 0x1UL /**< The input parameters passed to the AXIDMAC API are not valid. */
} cy_en_axidmac_status_t;

/** \} group_axidmac_enums */

/** \cond Macros for the conditions used by CY_ASSERT calls */

#define CY_AXIDMAC_IS_LOOP_COUNT_VALID(count)      (((count) >= CY_AXIDMAC_LOOP_COUNT_MIN) && ((count) <= CY_AXIDMAC_LOOP_COUNT_MAX))
#define CY_AXIDMAC_IS_LOOP_INCR_VALID(incr)        (((incr) >= CY_AXIDMAC_LOOP_INCREMENT_MIN) && ((incr) <= CY_AXIDMAC_LOOP_INCREMENT_MAX))
#define CY_AXIDMAC_IS_PRIORITY_VALID(prio)         ((prio) <= 3UL)
#define CY_AXIDMAC_INTR_MASK                       (CY_AXIDMAC_INTR_COMPLETION         | \
                                                 CY_AXIDMAC_INTR_SRC_BUS_ERROR      | \
                                                 CY_AXIDMAC_INTR_DST_BUS_ERROR      | \
                                                 CY_AXIDMAC_INTR_INVALID_DESCR_TYPE | \
                                                 CY_AXIDMAC_INTR_CURR_PTR_NULL      | \
                                                 CY_AXIDMAC_INTR_ACTIVE_CH_DISABLED | \
                                                 CY_AXIDMAC_INTR_DESCR_BUS_ERROR)

#define CY_AXIDMAC_IS_INTR_MASK_VALID(intr)      (0UL == ((intr) & ((uint32_t) ~CY_AXIDMAC_INTR_MASK)))

#define CY_AXIDMAC_IS_RETRIGGER_VALID(retrigger) ((CY_AXIDMAC_RETRIG_IM      == (retrigger)) || \
                                                 (CY_AXIDMAC_RETRIG_4CYC    == (retrigger)) || \
                                                 (CY_AXIDMAC_RETRIG_16CYC   == (retrigger)) || \
                                                 (CY_AXIDMAC_WAIT_FOR_REACT == (retrigger)))

#define CY_AXIDMAC_IS_TRIG_TYPE_VALID(trigType)  ((CY_AXIDMAC_M_LOOP    == (trigType)) || \
                                                 (CY_AXIDMAC_X_LOOP      == (trigType)) || \
                                                 (CY_AXIDMAC_DESCR       == (trigType)) || \
                                                 (CY_AXIDMAC_DESCR_CHAIN == (trigType)))

#define CY_AXIDMAC_IS_CHANNEL_STATE_VALID(state) ((CY_AXIDMAC_CHANNEL_ENABLED  == (state)) || \
                                                 (CY_AXIDMAC_CHANNEL_DISABLED == (state)))


#define CY_AXIDMAC_IS_TYPE_VALID(descrType)      ((CY_AXIDMAC_1D_MEMORY_COPY  == (descrType)) || \
                                                 (CY_AXIDMAC_2D_MEMORY_COPY      == (descrType)) || \
                                                 (CY_AXIDMAC_3D_MEMORY_COPY == (descrType)))

#define CY_AXIDMAC_IS_CH_NR_VALID(chNr)          (CY_AXIDMAC_CH_NR > (chNr))

/** \endcond */

/**
* \addtogroup group_axidmac_data_structures
* \{
*/


/**
* AXIDMAC descriptor structure type. It is a user-declared structure
* allocated in RAM. The AXIDMAC HW requires a pointer to this structure to work with it.
*
* For advanced users: the descriptor can be allocated even in flash, however the user
* have to predefine all the structure items with constants manually,
* because the descriptor "Set" API functions (including \ref Cy_AXIDMAC_Descriptor_Init())
* don't work with read-only descriptors.
*/
typedef struct
{
    uint32_t ctl;                    /*!< Descriptor control */
    uint32_t src;                    /*!< Descriptor source holds the base address of source location */
    uint32_t dst;                    /*!< Descriptor destination holds the base address of destination location*/
    uint32_t mSize;                  /*!< Descriptor memory copy size. Valid range is 0...16777216 */
    uint32_t xSize;                  /*!< Descriptor X loop size. Valid range is 0...65535 */
    int32_t xIncr;                   /*!< Descriptor X loop increment. Valid range is -32768...32767 */
    uint32_t ySize;                  /*!< Descriptor Y loop size. Valid range is 0...65535 */
    int32_t yIncr;                   /*!< Descriptor Y loop increment. Valid range is -32768...32767 */
    uint32_t nextPtr;                /*!< Descriptor next pointer */
} cy_stc_axidmac_descriptor_t;

